### 1. Count()

In [1]:
from mysql.connector import connect

#### 1. Number of employees working in each department?

In [5]:
hr_db=connect(host='localhost', user='root', password='Theuserdied@8', database='hr')

mycursor=hr_db.cursor()
mycursor.execute("SELECT DEPARTMENT_ID, COUNT(EMPLOYEE_ID) FROM EMPLOYEES GROUP BY DEPARTMENT_ID")

print("Department_ID","         ", "Number_of_Employees")
for employee in mycursor:
    print(employee[0]," "*20, employee[1])

Department_ID           Number_of_Employees
None                      1
10                      1
20                      2
30                      6
40                      1
50                      45
60                      5
70                      1
80                      34
90                      3
100                      6
110                      2

#### 2. Number of employees working in different job

In [6]:
mycursor.execute("SELECT Job_ID, COUNT(EMPLOYEE_ID) FROM EMPLOYEES GROUP BY job_ID")

print("Job_ID","         ", "Number_of_Employees")
for employee in mycursor:
    print(employee[0]," "*20, employee[1])

Job_ID           Number_of_Employees
AC_ACCOUNT                      1
AC_MGR                      1
AD_ASST                      1
AD_PRES                      1
AD_VP                      2
FI_ACCOUNT                      5
FI_MGR                      1
HR_REP                      1
IT_PROG                      5
MK_MAN                      1
MK_REP                      1
PR_REP                      1
PU_CLERK                      5
PU_MAN                      1
SA_MAN                      5
SA_REP                      30
SH_CLERK                      20
ST_CLERK                      20
ST_MAN                      5

### 2. Sum()

#### 1. Calculate sum of salary for each department

In [8]:
mycursor.execute("SELECT DEPARTMENT_ID, SUM(SALARY) FROM EMPLOYEES GROUP BY DEPARTMENT_ID")

print("Department_ID","         ", "Sum_of_Salary")
for employee in mycursor:
    print(employee[0]," "*20, employee[1])

Department_ID           Sum_of_Salary
None                      7000.00
10                      4400.00
20                      19000.00
30                      24900.00
40                      6500.00
50                      156400.00
60                      28800.00
70                      10000.00
80                      304500.00
90                      58000.00
100                      51600.00
110                      20300.00

#### 2. Calculate total commission perentage for each department

In [9]:
mycursor.execute("SELECT DEPARTMENT_ID, SUM(COMMISSION_PCT) FROM EMPLOYEES GROUP BY DEPARTMENT_ID")

print("Department_ID","         ", "Sum_of_commission")
for employee in mycursor:
    print(employee[0]," "*20, employee[1])

Department_ID           Sum_of_commission
None                      0.15
10                      None
20                      None
30                      None
40                      None
50                      None
60                      None
70                      None
80                      7.65
90                      None
100                      None
110                      None

### 3. Min(), Max()

#### 1. Calculate minimum and maximum salary for each department

In [12]:
mycursor.execute("SELECT DEPARTMENT_ID, MIN(SALARY), MAX(SALARY) FROM EMPLOYEES GROUP BY DEPARTMENT_ID")

print("Department_ID","    ", "Minimum_Salary","    ", "Maximum_Salary")
for employee in mycursor:
    print(employee[0]," "*12, employee[1]," "*12, employee[2])

Department_ID      Minimum_Salary      Maximum_Salary
None              7000.00              7000.00
10              4400.00              4400.00
20              6000.00              13000.00
30              2500.00              11000.00
40              6500.00              6500.00
50              2100.00              8200.00
60              4200.00              9000.00
70              10000.00              10000.00
80              6100.00              14000.00
90              17000.00              24000.00
100              6900.00              12000.00
110              8300.00              12000.00

### 4. Avg()

#### 1. Calculate average salary for each job role?

In [14]:
mycursor.execute("SELECT JOB_ID, AVG(SALARY) FROM EMPLOYEES GROUP BY JOB_ID")

print("Job_ID","         ", "Average_Salary")
for employee in mycursor:
    print(employee[0]," "*12, employee[1])

Job_ID           Average_Salary
AC_ACCOUNT              8300.000000
AC_MGR              12000.000000
AD_ASST              4400.000000
AD_PRES              24000.000000
AD_VP              17000.000000
FI_ACCOUNT              7920.000000
FI_MGR              12000.000000
HR_REP              6500.000000
IT_PROG              5760.000000
MK_MAN              13000.000000
MK_REP              6000.000000
PR_REP              10000.000000
PU_CLERK              2780.000000
PU_MAN              11000.000000
SA_MAN              12200.000000
SA_REP              8350.000000
SH_CLERK              3215.000000
ST_CLERK              2785.000000
ST_MAN              7280.000000

### 5. Round()

In [15]:
mycursor.execute("SELECT JOB_ID, ROUND(AVG(SALARY),2) FROM EMPLOYEES GROUP BY JOB_ID")

print("Job_ID","         ", "Average_Salary")
for employee in mycursor:
    print(employee[0]," "*12, employee[1])

Job_ID           Average_Salary
AC_ACCOUNT              8300.00
AC_MGR              12000.00
AD_ASST              4400.00
AD_PRES              24000.00
AD_VP              17000.00
FI_ACCOUNT              7920.00
FI_MGR              12000.00
HR_REP              6500.00
IT_PROG              5760.00
MK_MAN              13000.00
MK_REP              6000.00
PR_REP              10000.00
PU_CLERK              2780.00
PU_MAN              11000.00
SA_MAN              12200.00
SA_REP              8350.00
SH_CLERK              3215.00
ST_CLERK              2785.00
ST_MAN              7280.00

### 6. Distinct()

#### Total employees working in a company.

In [18]:
mycursor.execute("SELECT COUNT(DISTINCT EMPLOYEE_ID) FROM EMPLOYEES")

print("Number of employees")
for employee in mycursor:
    print(employee[0])

Number of employees
107